class Cart < ApplicationRecord
    #--------------------------------------------------
    # 論理削除
    #--------------------------------------------------
    include Discard::Model
    # 論理削除したレコードを返さないように
    default_scope -> { kept }

    #--------------------------------------------------
    # リレーション
    #--------------------------------------------------
    belongs_to :user
    belongs_to :product

    #カート 1対多
    has_many :cart_details, -> { order(delivery_day: :asc) }

    #--------------------------------------------------
    # アクセサメソッド
    #--------------------------------------------------
    attr_accessor :datetime_got_product         # 商品取得日時

    #--------------------------------------------------
    # バリデーション
    #--------------------------------------------------
    validates :price, presence: true,
        numericality: { greater_than_or_equal_to: 0 }

end
