class DeliveryOrder < ApplicationRecord
    #--------------------------------------------------
    # 論理削除
    #--------------------------------------------------
    include Discard::Model
    # 論理削除したレコードを返さないように
    default_scope -> { kept }

    #-----------------------------
    # バリデーション
    #-----------------------------
    validates :position, presence: true

    #--------------------------------------------------
    # リレーション
    #--------------------------------------------------
    # 配送ルート 多対多
    belongs_to :delivery_location
    belongs_to :delivery_course

    #--------------------------------------------------
    # 機能
    #--------------------------------------------------
    # 並べ換え
    acts_as_list scope: [:delivery_course_id]
end
