class ProductImage < ApplicationRecord
    #--------------------------------------------------
    # 論理削除
    #--------------------------------------------------
    include Discard::Model
    # 論理削除したレコードを返さないように
    default_scope -> { kept }

    #-----------------------------
    # バリデーション
    #-----------------------------
    validates :image, presence: true

    #--------------------------------------------------
    # リレーション
    #--------------------------------------------------
    belongs_to :product
    
    #--------------------------------------------------
    # uploaderと紐付け
    #--------------------------------------------------
    mount_uploader :image, ProductImageUploader
end
